In [1]:
import json # import json module
import pandas as pd
with open('18~20 1분기 임대료.json', encoding='UTF-8') as json_file:
    data = json.load(json_file)
    df1 = pd.DataFrame(data)
df1.head()

,NM,GUBUN,BF1_TOT_FLOOR,BF1_FST_FLOOR,BF1_EX_FLOOR,BF2_TOT_FLOOR,BF2_FST_FLOOR,BF2_EX_FLOOR,BF3_TOT_FLOOR,BF3_FST_FLOOR,BF3_EX_FLOOR
0,서울시전체,si,114948,131016,96707,116984,132986,99721,120854,135148,106287
1,종로구,gu,184919,217763,155681,183435,217272,152261,175410,214855,142856
2,계동길 (가회동),dong,143504,164337,101838,128907,134200,111263,149372,168159,108040
3,난계로27길 (숭인2동),dong,112278,169559,57791,105563,128987,71806,83098,120490,57131
4,돈화문로11가길 (종로1.2.3.4가동),dong,188843,257637,107868,197742,271591,115139,195669,259583,130183

In [2]:
cols=['NM', 'BF1_FST_FLOOR', 'BF2_FST_FLOOR']
colnames=['주소', '18년 임대료', '19년 임대료']
df1 = df1[cols]
for i in range(len(cols)) :
    df1.rename(columns= {cols[i]:colnames[i]}, inplace = True)
df1

                          주소 18년 임대료 19년 임대료
0                      서울시전체  131016  132986
1                        종로구  217763  217272
2                  계동길 (가회동)  164337  134200
3              난계로27길 (숭인2동)  169559  128987
4     돈화문로11가길 (종로1.2.3.4가동)  257637  271591
...                      ...     ...     ...
1031           천호대로197길 (길동)  108313  115451
1032          천호대로219길 (상일동)   81857   77462
1033           천호옛14길 (성내2동)  115232  114348
1034             천호옛길 (성내2동)  115232  114348
1035          풍성로37가길 (성내2동)  115232  114348

[1036 rows x 3 columns]

In [3]:
with open('15~17 1분기 임대료.json', encoding='UTF-8') as json_file:
    data = json.load(json_file)
    df2 = pd.DataFrame(data)
cols=['NM', 'BF1_FST_FLOOR', 'BF2_FST_FLOOR', 'BF3_FST_FLOOR']
colnames=['주소', '15년 임대료', '16년 임대료', '17년 임대료']
df2 = df2[cols]
for i in range(len(cols)) :
    df2.rename(columns= {cols[i]:colnames[i]}, inplace = True)
df2

                          주소 15년 임대료 16년 임대료 17년 임대료
0                      서울시전체  115456  120802  122453
1                        종로구  196464  200560  207788
2                  계동길 (가회동)  207844  170226  143968
3              난계로27길 (숭인2동)  123899  160987  125576
4     돈화문로11가길 (종로1.2.3.4가동)  235473  225870  255062
...                      ...     ...     ...     ...
1031           천호대로197길 (길동)   99478  110465  108907
1032          천호대로219길 (상일동)   57980   73740   78006
1033           천호옛14길 (성내2동)  118404  103862  102767
1034             천호옛길 (성내2동)  118404  103862  102767
1035          풍성로37가길 (성내2동)  118404  103862  102767

[1036 rows x 4 columns]

In [4]:
dong=[]
eighteen=[]
nineteen=[]
current=[]
for i in range(0,len(df1)):
    if '(' in df1.iloc[i,0]:
        dong.append(df1.iloc[i,0].split(" ")[0])
        eighteen.append(df1.iloc[i,1])
        nineteen.append(df1.iloc[i,2])

In [5]:
df=pd.DataFrame({'동':dong,
'18년도': eighteen,
'19년도': nineteen})

In [6]:
df

             동    18년도    19년도
0          계동길  164337  134200
1       난계로27길  169559  128987
2     돈화문로11가길  257637  271591
3          명륜길  145130  168065
4         백석동길  122674   99955
...        ...     ...     ...
1005  천호대로197길  108313  115451
1006  천호대로219길   81857   77462
1007    천호옛14길  115232  114348
1008      천호옛길  115232  114348
1009   풍성로37가길  115232  114348

[1010 rows x 3 columns]

In [7]:
df2

                          주소 15년 임대료 16년 임대료 17년 임대료
0                      서울시전체  115456  120802  122453
1                        종로구  196464  200560  207788
2                  계동길 (가회동)  207844  170226  143968
3              난계로27길 (숭인2동)  123899  160987  125576
4     돈화문로11가길 (종로1.2.3.4가동)  235473  225870  255062
...                      ...     ...     ...     ...
1031           천호대로197길 (길동)   99478  110465  108907
1032          천호대로219길 (상일동)   57980   73740   78006
1033           천호옛14길 (성내2동)  118404  103862  102767
1034             천호옛길 (성내2동)  118404  103862  102767
1035          풍성로37가길 (성내2동)  118404  103862  102767

[1036 rows x 4 columns]

In [8]:
 fifteen=[]
sixteen=[]
seventeen=[]
for i in range(0,len(df2)):
    if '(' in df2.iloc[i,0]:
        # dong.append(df2.iloc[i,0].split(" ")[0])
        fifteen.append(df2.iloc[i,1])
        sixteen.append(df2.iloc[i,2])
        seventeen.append(df2.iloc[i,3])

In [9]:
len(dong)

1010

In [10]:
df2=pd.DataFrame({'동':dong,
'15년도': fifteen,
'16년도': sixteen,
'17년도': seventeen})

In [11]:
df1

                          주소 18년 임대료 19년 임대료
0                      서울시전체  131016  132986
1                        종로구  217763  217272
2                  계동길 (가회동)  164337  134200
3              난계로27길 (숭인2동)  169559  128987
4     돈화문로11가길 (종로1.2.3.4가동)  257637  271591
...                      ...     ...     ...
1031           천호대로197길 (길동)  108313  115451
1032          천호대로219길 (상일동)   81857   77462
1033           천호옛14길 (성내2동)  115232  114348
1034             천호옛길 (성내2동)  115232  114348
1035          풍성로37가길 (성내2동)  115232  114348

[1036 rows x 3 columns]

In [12]:
df2

             동    15년도    16년도    17년도
0          계동길  207844  170226  143968
1       난계로27길  123899  160987  125576
2     돈화문로11가길  235473  225870  255062
3          명륜길  160483  154515  152953
4         백석동길   89782  107941   99467
...        ...     ...     ...     ...
1005  천호대로197길   99478  110465  108907
1006  천호대로219길   57980   73740   78006
1007    천호옛14길  118404  103862  102767
1008      천호옛길  118404  103862  102767
1009   풍성로37가길  118404  103862  102767

[1010 rows x 4 columns]

In [13]:
df3=pd.merge(df2,df).set_index('동')

In [14]:
df3

            15년도    16년도    17년도    18년도    19년도
동
계동길       207844  170226  143968  164337  134200
난계로27길    123899  160987  125576  169559  128987
돈화문로11가길  235473  225870  255062  257637  271591
명륜길       160483  154515  152953  145130  168065
백석동길       89782  107941   99467  122674   99955
...          ...     ...     ...     ...     ...
천호대로197길   99478  110465  108907  108313  115451
천호대로219길   57980   73740   78006   81857   77462
천호옛14길    118404  103862  102767  115232  114348
천호옛길      118404  103862  102767  115232  114348
풍성로37가길   118404  103862  102767  115232  114348

[1010 rows x 5 columns]

In [15]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1010 entries, 계동길 to 풍성로37가길
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   15년도    1010 non-null   object
 1   16년도    1010 non-null   object
 2   17년도    1010 non-null   object
 3   18년도    1010 non-null   object
 4   19년도    1010 non-null   object
dtypes: object(5)
memory usage: 47.3+ KB

In [16]:
# X=df3[['15년도','16년도','17년도','18년도','19년도']]
# y=df3[['동']]

In [17]:
import numpy as np
df3=df3.replace(r'^\s+$', np.nan, regex=True).apply(pd.to_numeric)

In [18]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1010 entries, 계동길 to 풍성로37가길
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   15년도    980 non-null    float64
 1   16년도    1001 non-null   float64
 2   17년도    1007 non-null   float64
 3   18년도    1010 non-null   int64
 4   19년도    1009 non-null   float64
dtypes: float64(4), int64(1)
memory usage: 47.3+ KB

In [19]:
# df3['15년도']=pd.to_numeric(df3['15년도'])
# df3['16년도']=pd.to_numeric(df3['16년도'])
# df3['17년도']=pd.to_numeric(df3['17년도'])
# df3['18년도']=pd.to_numeric(df3['18년도'])
# df3['19년도']=pd.to_numeric(df3['19년도'])

In [20]:
df3.isnull().sum()

15년도    30
16년도     9
17년도     3
18년도     0
19년도     1
dtype: int64

In [21]:
import numpy as np
for i in range(len(df3.columns)):
    df3.iloc[:,i] = df3.iloc[:,i].replace(np.nan, np.mean(df3.iloc[:,i]))

In [22]:
df3=df3.astype(int)

In [23]:
df3

            15년도    16년도    17년도    18년도    19년도
동
계동길       207844  170226  143968  164337  134200
난계로27길    123899  160987  125576  169559  128987
돈화문로11가길  235473  225870  255062  257637  271591
명륜길       160483  154515  152953  145130  168065
백석동길       89782  107941   99467  122674   99955
...          ...     ...     ...     ...     ...
천호대로197길   99478  110465  108907  108313  115451
천호대로219길   57980   73740   78006   81857   77462
천호옛14길    118404  103862  102767  115232  114348
천호옛길      118404  103862  102767  115232  114348
풍성로37가길   118404  103862  102767  115232  114348

[1010 rows x 5 columns]

In [24]:
# df4=df3.reset_index()

In [25]:
# df5=df3.reset_index(inplace=True)

In [26]:
df3

            15년도    16년도    17년도    18년도    19년도
동
계동길       207844  170226  143968  164337  134200
난계로27길    123899  160987  125576  169559  128987
돈화문로11가길  235473  225870  255062  257637  271591
명륜길       160483  154515  152953  145130  168065
백석동길       89782  107941   99467  122674   99955
...          ...     ...     ...     ...     ...
천호대로197길   99478  110465  108907  108313  115451
천호대로219길   57980   73740   78006   81857   77462
천호옛14길    118404  103862  102767  115232  114348
천호옛길      118404  103862  102767  115232  114348
풍성로37가길   118404  103862  102767  115232  114348

[1010 rows x 5 columns]

In [27]:
# df3.reset_index(inplace=True)

In [31]:
df3

            15년도    16년도    17년도    18년도    19년도
동
계동길       207844  170226  143968  164337  134200
난계로27길    123899  160987  125576  169559  128987
돈화문로11가길  235473  225870  255062  257637  271591
명륜길       160483  154515  152953  145130  168065
백석동길       89782  107941   99467  122674   99955
...          ...     ...     ...     ...     ...
천호대로197길   99478  110465  108907  108313  115451
천호대로219길   57980   73740   78006   81857   77462
천호옛14길    118404  103862  102767  115232  114348
천호옛길      118404  103862  102767  115232  114348
풍성로37가길   118404  103862  102767  115232  114348

[1010 rows x 5 columns]

In [69]:
import pandas as pd 
df=pd.read_csv("test.csv",index_col="동")
df

            15년도    16년도    17년도    18년도    19년도
동
계동길       207844  170226  143968  164337  134200
난계로27길    123899  160987  125576  169559  128987
돈화문로11가길  235473  225870  255062  257637  271591
명륜길       160483  154515  152953  145130  168065
백석동길       89782  107941   99467  122674   99955
...          ...     ...     ...     ...     ...
천호대로197길   99478  110465  108907  108313  115451
천호대로219길   57980   73740   78006   81857   77462
천호옛14길    118404  103862  102767  115232  114348
천호옛길      118404  103862  102767  115232  114348
풍성로37가길   118404  103862  102767  115232  114348

[1010 rows x 5 columns]

In [70]:
df.reset_index(inplace=True)